---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.OmniclassCode
source: html/90fba405-1ce0-1a4c-f601-3a4e91d34eaf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.OmniclassCode Property

"OmniClass Number"

## Syntax (C#)
```csharp
public static ForgeTypeId OmniclassCode { get; }
```